<template>
  <div class="flex justify-center bg-primary/50">
    <div class="space-y-4 sm:py-12 py-8 text-center">
      <div class="text-primary-content sm:text-5xl text-4xl font-bold">
        วิธีการสั่งซื้อ
      </div>
      <div class="badge sm:badge-sm badge-xs badge-soft badge-primary py-3">
        <NuxtLink to="/">หน้าแรก</NuxtLink>
        <Icon name="lucide:chevron-right" size="15" />
        <span class="text-base-content">วิธีการสั่งซื้อ</span>
      </div>
    </div>
  </div>
  <div
    class="mx-auto w-full max-w-7xl px-4 py-6 sm:px-6 sm:py-8 lg:px-8 lg:py-10"
  >
    <div class="space-y-4 p-4 sm:p-6 lg:p-8">
      <div class="text-primary sm:text-4xl text-3xl font-bold">
        1. สั่งซื้อสินค้าที่หน้าร้าน
      </div>
      <div class="mt-3 space-y-2 sm:text-base text-sm">
        <div>
          วิธีการสั่งซื้อ : ลูกค้าสามารถเข้ามาสั่งซื้อกับพนักงานหน้าร้าน
          เมื่อชำระเงินเรียบร้อยลูกค้าสามารถรับสินค้ากลับได้เลยทันที
        </div>
        <div>
          * หมายเหตุ
          หากสั่งซื้อเป็นจำนวนมากทางร้านอาจขอเวลาในการจัดเตรียมสินค้าเพิ่มเติม
        </div>
        <div>
          * หมายเหตุ หากต้องการให้ทางร้านส่งขนส่งให้
          สามารถดูรายละเอียดให้ข้อกำหนดการจัดส่ง
        </div>
        <div class="text-primary sm:text-xl text-lg font-semibold mt-5">
          ข้อดีของการมาที่หน้าร้าน
        </div>
        <div>
          1. ลูกค้าสามารถสัมผัสสินค้าจริงที่หน้าร้านก่อนเลือกซื้อสินค้า
          เรามีสินค้าตัวอย่างให้ลูกค้าเลือกดูมากกว่า 3,000 รายการ
        </div>
        <div>
          2. ลูกค้าสามารถเข้ามาปรึกษาเกี่ยวกับการเลือกสินค้าไปขาย
          หรือให้ทางร้านจัดสินค้าให้ตามงบที่ลูกค้าตั้งไว้
          โดยเรามีพนักงานที่มีประสบการณ์มากกว่า 10 ปี คอยให้คำปรึกษา
          และดูแลลูกค้าที่หน้าร้าน
        </div>
        <div>
          3. ลูกค้าสามารถสั่งซื้อแล้วรอรับสินค้าได้เลย
          เนื่องจากร้านเรามีสินค้าพร้อมส่ง
        </div>
        <button
          class="btn btn-ghost sm:btn-md btn-sm btn-secondary sm:w-fit w-full"
          @click="openMap"
        >
          <Icon name="lucide:map-pinned" size="18" /> แผนที่ร้าน
        </button>
      </div>
    </div>
    <div class="space-y-4 p-4 sm:p-6 lg:p-8">
      <div class="text-primary sm:text-4xl text-3xl font-bold">
        2. สั่งซื้อสินค้าผ่าน Line
      </div>
      <div class="mt-3 space-y-2 sm:text-base text-sm">
        <div>1. แอดไลน์ของทางร้าน Line ID : @005crnlq</div>
        <div>
          2. ลูกค้าสั่งสินค้าโดย ส่งรายการสินค้าให้แอดมินใน Line
          แอดมินจะดำเนินการ สรุปยอด และตกลงเรื่องการจัดส่ง
        </div>
        <div>
          3. หากลูกค้ามีข้อสงสัยในเรื่อง การสั่งซื้อ, การจัดส่ง, ราคาสินค้า,
          และอื่นๆ ลูกค้าสามารถสอบถามกับทางแอดมินได้เช่นกัน
        </div>
      </div>
    </div>
    <div class="space-y-4 p-4 sm:p-6 lg:p-8">
      <div class="text-primary text-4xl font-bold">
        3. ขั้นตอนการสั่งซื้อสินค้าผ่าน เว็บไซต์
      </div>
      <div class="mt-3">1. เพิ่มสินค้าลงในรถเข็น</div>
      <div>2. กดสั่งซื้อสินค้าในรถเข็น</div>
      <div>3. กรอกข้อมูลสำหรับการจัดส่ง และกดยืนยันคำสั่งซื้อ</div>
      <div>
        4. ภายใน 1 วันทำการแอดมินจะติดต่อกลับหาลูกค้าทางเบอร์โทรศัพท์ที่ให้ไว้
        เพื่อยืนยันรายการสินค้า, ยืนยันการจัดส่ง และสรุปยอด
      </div>
      <div>5. ลูกค้าชำระเงิน โดยโอนเงินเข้าบัญชีที่แอดมินแจ้ง</div>
      <div>6. ลูกค้าสามารถรับสินค้าได้ 2 ทาง</div>
      <div>– มารับสินค้าด้วยตัวเองที่หน้าร้านฟินลี่แลนด์พลาซ่า สาขาเวียงสา</div>
      <div>
        – หากต้องการให้ทางร้านนำส่งขนส่ง
        ทางร้านจะนำส่งสินค้าหลังจากวันที่ได้รับการยืนยันการชำระเงิน 1-2 วันทำการ
        หากตรงกับวันหยุดนักขัตฤกษ์อาจมีเลื่อวันกำหนดส่งเป็นวันถัดไป
      </div>
    </div>
    <div class="space-y-4 p-4 sm:p-6 lg:p-8">
      <div class="text-primary text-4xl font-bold">ข้อกำหนดในการซื้อสินค้า</div>
      <div class="mt-3">
        1. คำสั่งซื้อบนเว็บไซต์จะต้องมียอดเกิน 1,500 บาท เท่านั้น
      </div>
      <div>
        2. รายการสินค้าที่ลูกค้าสั่งเข้ามาอาจมีการเปลี่ยนแปลง เนื่องจากสินค้าหมด
        และอื่นๆ
        โดยแอดมินจะแจ้งรายละเอียดที่เปลี่ยนแปลงให้ลูกค้าทราบก่อนแจ้งให้ลูกค้าชำระเงิน
      </div>
      <div>3. ราคาของสินค้าอาจมีการเปลี่ยนแปลงโดยไม่ได้แจ้งล่วงหน้า</div>
      <div>4. ราคาที่แสดงเป็นราคาที่รวมภาษีมูลค่าเพิ่มแล้ว</div>
      <div>
        5. หากต้องการใบกำกับภาษี กรุณาทำเครื่องหมาย ☑ ในช่อง 'ขอใบกำกับภาษี'
        และกรอกข้อมูลให้ครบถ้วน
      </div>
      <div>
        6. ทางร้าน มีสิทธิเปลี่ยนแปลงข้อกำหนดต่างๆโดยไม่ต้องแจ้งล่วงหน้า
      </div>
    </div>
    <div class="space-y-4 p-4 sm:p-6 lg:p-8">
      <div class="text-primary text-4xl font-bold">ข้อกำหนดในการจัดส่ง</div>
      <div class="mt-3">
        – ร้านฟินลี่แลนด์มีบริการนำส่งสินค้าให้กับลูกค้าในบริเวณใกล้เคียง
        และส่งสินค้าให้กับบริษัทขนส่ง ยอดสั่งซื้อขั้นต่ำสำหรับบริการนำส่ง 1,500
        บาท
      </div>
      <div>
        – ร้านฟินลี่แลนด์มีสิทธิกำหนดหรือเปลี่ยนแปลงบริษัทขนส่งที่จะทำการจัดส่ง
        และจะแจ้งให้ลูกค้าทราบรายละเอียดการเปลี่ยนแปลงก่อนนำส่งสินค้า
      </div>
      <div>
        – ร้านฟินลี่แลนด์อาจมีการคิดค่าจัดส่งเพิ่มเติมตามดุลพินิจของร้าน
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
const openMap = () => {
  window.open("https://maps.app.goo.gl/QLdLX6w2srqyPVzM8", "_blank");
};
</script>
