<template>
  <div class="flex justify-center bg-primary/50">
    <div class="space-y-4 sm:py-12 py-8 text-center">
      <div class="text-primary-content sm:text-5xl text-4xl font-bold">
        วิธีการสั่งซื้อ
      </div>
      <div class="badge sm:badge-sm badge-xs badge-soft badge-primary py-3">
        <NuxtLink to="/">หน้าแรก</NuxtLink>
        <Icon name="lucide:chevron-right" size="15" />
        <span class="text-base-content">วิธีการสั่งซื้อ</span>
      </div>
    </div>
  </div>
  <div
    class="mx-auto w-full max-w-7xl px-4 py-6 sm:px-6 sm:py-8 lg:px-8 lg:py-10"
  >
    <div class="space-y-4 p-4 sm:p-6 lg:p-8 border-b border-base-300">
      <div class="text-primary lg:text-4xl sm:text-3xl text-2xl font-bold">
        1. สั่งซื้อสินค้าที่หน้าร้าน
      </div>
      <div class="mt-3 space-y-2 lg:text-base sm:text-sm text-xs">
        <div>
          วิธีการสั่งซื้อ : ลูกค้าสามารถเข้ามาสั่งซื้อกับพนักงานหน้าร้าน
          เมื่อชำระเงินเรียบร้อยลูกค้าสามารถรับสินค้ากลับได้เลยทันที
        </div>
        <div>
          * หมายเหตุ
          หากสั่งซื้อเป็นจำนวนมากทางร้านอาจขอเวลาในการจัดเตรียมสินค้าเพิ่มเติม
        </div>
        <div>
          * หมายเหตุ หากต้องการให้ทางร้านส่งขนส่งให้
          สามารถดูรายละเอียดได้ที่หัวข้อข้อกำหนดในการจัดส่ง
        </div>
        <div class="text-primary sm:text-xl text-lg font-semibold mt-5">
          ข้อดีของการมาที่หน้าร้าน
        </div>
        <div>
          1. ลูกค้าสามารถสัมผัสสินค้าจริงที่หน้าร้านก่อนเลือกซื้อสินค้า
          เรามีสินค้าตัวอย่างให้ลูกค้าเลือกดูมากกว่า 3,000 รายการ
        </div>
        <div>
          2. ลูกค้าสามารถเข้ามาปรึกษาเกี่ยวกับการเลือกสินค้าไปขาย
          หรือให้ทางร้านจัดสินค้าให้ตามงบที่ลูกค้าตั้งไว้
          โดยเรามีพนักงานที่มีประสบการณ์มากกว่า 10 ปี คอยให้คำปรึกษา
          และดูแลลูกค้าที่หน้าร้าน
        </div>
        <div>
          3. ลูกค้าสามารถสั่งซื้อแล้วรอรับสินค้าได้เลย
          เนื่องจากร้านเรามีสินค้าพร้อมส่ง
        </div>
        <button
          class="btn btn-link no-underline hover:underline lg:btn-md sm:btn-sm btn-xs text-base-content/75 hover:text-primary sm:w-fit w-full"
          @click="openMap"
        >
          <Icon name="lucide:map-pinned" size="18" /> แผนที่ร้าน
        </button>
      </div>
    </div>
    <div class="space-y-4 p-4 sm:p-6 lg:p-8 border-b border-base-300">
      <div class="mt-3 text-primary lg:text-4xl sm:text-3xl text-2xl font-bold">
        2. สั่งซื้อสินค้าผ่าน Line
      </div>
      <div class="mt-3 space-y-2 lg:text-base sm:text-sm text-xs">
        <div>1. แอดไลน์ของทางร้าน Line ID : @005crnlq</div>
        <div>
          2. ลูกค้าสั่งสินค้าโดย ส่งรายการสินค้าให้แอดมินใน Line
          แอดมินจะดำเนินการ สรุปยอด และตกลงเรื่องการจัดส่ง
        </div>
        <div>
          3. หากลูกค้ามีข้อสงสัยในเรื่อง การสั่งซื้อ, การจัดส่ง, ราคาสินค้า,
          และอื่นๆ ลูกค้าสามารถสอบถามกับทางแอดมินได้เช่นกัน
        </div>
      </div>
    </div>
    <div class="space-y-4 p-4 sm:p-6 lg:p-8 border-b border-base-300">
      <div class="mt-3 text-primary lg:text-4xl sm:text-3xl text-2xl font-bold">
        3. ขั้นตอนการสั่งซื้อสินค้าผ่านเว็บไซต์
      </div>
      <div class="mt-3 space-y-2 lg:text-base sm:text-sm text-xs">
        <div>1. เลือกสินค้าและเพิ่มสินค้าลงในตะกร้า</div>
        <div>
          2. เปิดหน้าตะกร้าสินค้า ตรวจสอบรายการและยอดสินค้าสุทธิหลังหักส่วนลด
        </div>
        <div>
          3. เลือกวิธีรับสินค้า ได้แก่ รับสินค้าด้วยตัวเอง ส่งด่วนใกล้บ้าน
          ไปรษณีย์ไทย EMS หรือ Flash Express Bulky
        </div>
        <div>
          4. หากเลือกวิธีจัดส่ง กรุณาเพิ่มหรือเลือกที่อยู่จัดส่ง
          ระบบจะแสดงค่าขนส่งและตรวจสอบว่าบริการนั้นพร้อมใช้งานหรือไม่
          ส่วนการรับสินค้าด้วยตัวเองไม่ต้องกรอกที่อยู่จัดส่ง
        </div>
        <div>
          5. หากต้องการใบกำกับภาษี ให้เลือก “ขอใบกำกับภาษี”
          และเลือกข้อมูลผู้เสียภาษีให้ครบถ้วน
        </div>
        <div>
          6. อ่านและยอมรับเงื่อนไขการสั่งซื้อ จากนั้นกด “ดำเนินการสั่งซื้อ”
          และยืนยันคำสั่งซื้อ
        </div>
        <div>
          7. ชำระเงินตามยอดของคำสั่งซื้อและแนบสลิปในหน้าชำระเงิน
          ร้านจะตรวจสอบการชำระเงินก่อนดำเนินการจัดเตรียมหรือจัดส่งสินค้า
        </div>
      </div>
    </div>
    <div class="space-y-4 p-4 sm:p-6 lg:p-8 border-b border-base-300">
      <div class="mt-3 text-primary lg:text-4xl sm:text-3xl text-2xl font-bold">
        ข้อกำหนดในการซื้อสินค้า
      </div>
      <div class="mt-3 space-y-2 lg:text-base sm:text-sm text-xs">
        <div>
          1. การรับสินค้าด้วยตัวเองไม่มีขั้นต่ำ ลูกค้าสามารถสั่งซื้อได้ทุกยอด
        </div>
        <div>
          2. รายการสินค้าที่ลูกค้าสั่งเข้ามาอาจมีการเปลี่ยนแปลง เช่น
          สินค้าหมดหรืออยู่ระหว่างรอเติมสต็อก ร้านจะแจ้งรายละเอียดให้ลูกค้าทราบ
          และหากร้านไม่สามารถจัดหาสินค้าได้จะคืนเงินค่าสินค้ารายการนั้น
        </div>
        <div>3. ราคาของสินค้าอาจมีการเปลี่ยนแปลงโดยไม่ได้แจ้งล่วงหน้า</div>
        <div>4. ราคาที่แสดงเป็นราคาที่รวมภาษีมูลค่าเพิ่มแล้ว</div>
        <div>
          5. หากต้องการใบกำกับภาษี กรุณาทำเครื่องหมาย ☑ ในช่อง 'ขอใบกำกับภาษี'
          และกรอกข้อมูลให้ครบถ้วน
        </div>
        <div>
          6. ทางร้าน มีสิทธิเปลี่ยนแปลงข้อกำหนดต่างๆโดยไม่ต้องแจ้งล่วงหน้า
        </div>
      </div>
    </div>
    <div class="space-y-4 p-4 sm:p-6 lg:p-8">
      <div class="mt-3 text-primary lg:text-4xl sm:text-3xl text-2xl font-bold">
        ข้อกำหนดในการจัดส่ง
      </div>
      <div class="mt-3 space-y-2 lg:text-base sm:text-sm text-xs">
        <div>
          – รับสินค้าด้วยตัวเองที่หน้าร้านฟินลี่แลนด์พลาซ่า สาขาเวียงสา
          ไม่มีขั้นต่ำและไม่มีค่าขนส่ง
        </div>
        <div>
          – ส่งด่วนใกล้บ้านให้บริการจัดส่งภายใน 1–2 ชั่วโมง
          สำหรับที่อยู่ในระยะทางไม่เกิน 10 กิโลเมตรจากร้าน
          และมียอดสินค้าสุทธิหลังหักส่วนลดขั้นต่ำ 500 บาท
        </div>
        <div>
          – ค่าขนส่งสำหรับส่งด่วนใกล้บ้านคิด 5% ของยอดสินค้าสุทธิ
          จากนั้นปัดขึ้นเป็นจำนวนเต็มที่ลงท้ายด้วย 5 หรือ 9 เช่น 31 บาทเป็น 35
          บาท และ 36 บาทเป็น 39 บาท โดยระบบจะแสดงค่าขนส่งก่อนยืนยันคำสั่งซื้อ
        </div>
        <div>
          – ไปรษณีย์ไทย EMS และ Flash Express Bulky
          คิดค่าขนส่งตามน้ำหนักและขนาดสินค้าหลังแพ็ก
          ระบบจะแสดงค่าขนส่งและความพร้อมของบริการตามที่อยู่ที่เลือก
        </div>
        <div>
          – สำหรับการจัดส่ง ลูกค้าต้องเลือกที่อยู่จัดส่งให้ครบถ้วน ส่วน EMS และ
          Flash Express Bulky ร้านจะดำเนินการหลังตรวจสอบการชำระเงินแล้ว
          โดยปกติใช้เวลาเตรียมและส่งต่อให้บริษัทขนส่ง 1–2 วันทำการ
          วันหยุดนักขัตฤกษ์อาจทำให้กำหนดส่งเลื่อนไปเป็นวันทำการถัดไป
        </div>
        <div>
          – ร้านฟินลี่แลนด์มีสิทธิเลือกหรือเปลี่ยนบริษัทขนส่งตามความเหมาะสม
          และจะแจ้งลูกค้าหากมีรายละเอียดการจัดส่งที่เปลี่ยนแปลง
        </div>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
const openMap = () => {
  window.open("https://maps.app.goo.gl/QLdLX6w2srqyPVzM8", "_blank");
};
</script>
