<template>
  <div class="w-full flex justify-center bg-primary/50">
    <div class="w-[50%] text-center py-10 space-y-3">
      <div class="text-primary-content text-5xl font-bold">วิธีการสั่งซื้อ</div>
      <div class="badge badge-sm badge-soft badge-primary py-3">
        <NuxtLink to="/">หน้าแรก</NuxtLink>/ วิธีการสั่งซื้อ
      </div>
    </div>
  </div>
  <div class="w-full flex justify-center">
    <div class="w-[75%] py-10">
      <div class="text-primary text-4xl font-bold">
        1. สั่งซื้อสินค้าที่หน้าร้าน
      </div>
      <div class="mt-3">
        วิธีการสั่งซื้อ : ลูกค้าสามารถเข้ามาสั่งซื้อกับพนักงานหน้าร้าน
        เมื่อชำระเงินเรียบร้อยลูกค้าสามารถรับสินค้ากลับได้เลยทันที
      </div>
      <div>
        * หมายเหตุ
        หากสั่งซื้อเป็นจำนวนมากทางร้านอาจขอเวลาในการจัดเตรียมสินค้าเพิ่มเติม
      </div>
      <div>
        * หมายเหตุ หากต้องการให้ทางร้านส่งขนส่งให้
        สามารถดูรายละเอียดให้ข้อกำหนดการจัดส่ง
      </div>
      <div class="text-primary text-xl font-semibold mt-5">
        ข้อดีของการมาที่หน้าร้าน
      </div>
      <div class="mt-3">
        1. ลูกค้าสามารถสัมผัสสินค้าจริงที่หน้าร้านก่อนเลือกซื้อสินค้า
        เรามีสินค้าตัวอย่างให้ลูกค้าเลือกดูมากกว่า 3,000 รายการ
      </div>
      <div>
        2. ลูกค้าสามารถเข้ามาปรึกษาเกี่ยวกับการเลือกสินค้าไปขาย
        หรือให้ทางร้านจัดสินค้าให้ตามงบที่ลูกค้าตั้งไว้
        โดยเรามีพนักงานที่มีประสบการณ์มากกว่า 10 ปี คอยให้คำปรึกษา
        และดูแลลูกค้าที่หน้าร้าน
      </div>
      <div>
        3. ลูกค้าสามารถสั่งซื้อแล้วรอรับสินค้าได้เลย
        เนื่องจากร้านเรามีสินค้าพร้อมส่ง
      </div>
      <button class="btn btn-primary mt-3" @click="openMap">
        แผนที่ร้าน <Icon name="lucide:circle-arrow-right" size="18" />
      </button>
    </div>
  </div>
  <div class="w-full flex justify-center">
    <div class="w-[75%] py-10">
      <div class="text-primary text-4xl font-bold">
        2. สั่งซื้อสินค้าผ่าน Line
      </div>
      <div class="mt-3">1. แอดไลน์ของทางร้าน Line ID : @ykcstore</div>
      <div>
        2. ลูกค้าสั่งสินค้าโดย ส่งรายการสินค้าให้แอดมินใน Line แอดมินจะดำเนินการ
        สรุปยอด และตกลงเรื่องการจัดส่ง
      </div>
      <div>
        3. หากลูกค้ามีข้อสงสัยในเรื่อง การสั่งซื้อ, การจัดส่ง, ราคาสินค้า,
        และอื่นๆ ลูกค้าสามารถสอบถามกับทางแอดมินได้เช่นกัน
      </div>
    </div>
  </div>
  <div class="w-full flex justify-center">
    <div class="w-[75%] py-10">
      <div class="text-primary text-4xl font-bold">
        3. ขั้นตอนการสั่งซื้อสินค้าผ่าน เว็บไซต์
      </div>
      <div class="mt-3">1. เพิ่มสินค้าลงในรถเข็น</div>
      <div>2. กดสั่งซื้อสินค้าในรถเข็น</div>
      <div>3. กรอกข้อมูลสำหรับการจัดส่ง และกดยืนยันคำสั่งซื้อ</div>
      <div>
        4. ภายใน 1 วันทำการแอดมินจะติดต่อกลับหาลูกค้าทางเบอร์โทรศัพท์ที่ให้ไว้
        เพื่อยืนยันรายการสินค้า, ยืนยันการจัดส่ง และสรุปยอด
      </div>
      <div>5. ลูกค้าชำระเงิน โดยโอนเงินเข้าบัญชีที่แอดมินแจ้ง</div>
      <div>6. ลูกค้าสามารถรับสินค้าได้ 2 ทาง</div>
      <div>– มารับสินค้าด้วยตัวเองที่หน้าร้านย่งกิมเชียง</div>
      <div>
        – หากต้องการให้ทางร้านนำส่งขนส่ง
        ทางร้านจะนำส่งสินค้าหลังจากวันที่ได้รับการยืนยันการชำระเงิน 1 วันทำการ
      </div>
    </div>
  </div>
  <div class="w-full flex justify-center">
    <div class="w-[75%] py-10">
      <div class="text-primary text-4xl font-bold">ข้อกำหนดในการซื้อสินค้า</div>
      <div class="mt-3">
        1. คำสั่งซื้อบนเว็บไซต์จะต้องมียอดเกิน 10,000 บาท เท่านั้น
      </div>
      <div>
        2. รายการสินค้าที่ลูกค้าสั่งเข้ามาอาจมีการเปลี่ยนแปลง เนื่องจากสินค้าหมด
        และอื่นๆ
        โดยแอดมินจะแจ้งรายละเอียดที่เปลี่ยนแปลงให้ลูกค้าทราบก่อนแจ้งให้ลูกค้าชำระเงิน
      </div>
      <div>
        3. สินค้าแต่ละรายการมีขั้นต่ำในการสั่งซื้อ
        โปรดตรวจสอบรายละเอียดก่อนสั่งซื้อ
      </div>
      <div>4. ราคาของสินค้าอาจมีการเปลี่ยนแปลงโดยไม่ได้แจ้งล่วงหน้า</div>
      <div>5. ราคาที่แสดงเป็นราคาที่ยังไม่รวมภาษีมูลค่าเพิ่ม</div>
      <div>
        6. ร้านย่งกิมเชียง มีสิทธิเปลี่ยนแปลงข้อกำหนดต่างๆโดยไม่ต้องแจ้งล่วงหน้า
      </div>
    </div>
  </div>
  <div class="w-full flex justify-center">
    <div class="w-[75%] py-10">
      <div class="text-primary text-4xl font-bold">ข้อกำหนดในการจัดส่ง</div>
      <div class="mt-3">
        – ร้านย่งกิมเชียงมีบริการนำส่งสินค้าให้กับบริษัทขนส่ง
        ยอดสั่งซื้อขั้นต่ำสำหรับบริการขนส่ง 10,000 บาท
      </div>
      <div>
        – ร้านย่งกิมเชียงมีสิทธิกำหนดหรือเปลี่ยนแปลงบริษัทขนส่งที่จะทำการจัดส่ง
        และจะแจ้งให้ลูกค้าทราบรายละเอียดการเปลี่ยนแปลงก่อนนำส่งสินค้า
      </div>
      <div>
        – ร้านย่งกิมเชียงอาจมีการคิดค่าจัดส่งเพิ่มเติมตามดุลพินิจของร้าน
      </div>
      <div>
        – ร้านย่งกิมเชียงไม่มีบริการส่งสินค้าด้วยแมสเซ็นเจอร์ และบริษัทขนส่ง
        เช่น ไปรษณีย์ไทย Kerry J&T
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
const openMap = () => {
  window.open("https://maps.app.goo.gl/QLdLX6w2srqyPVzM8", "_blank");
};
</script>
